# 별 찍기 - 23

"""
2021/06/26 12:47 오전
정웅교
문제: https://www.acmicpc.net/problem/13015
"""
n = int(input())
print('*' * n + ' ' * (2 * (n - 2) + 1) + '*' * n)
for i in range(1, n - 1):
    print(' ' * i + '*' + ' ' * (n - 2) + '*' + ' ' * (-2 * (i - 1) + (2 * (n - 2) - 1)) + '*' + ' ' * (n - 2) + '*')
print(' ' * (n - 1) + '*' + ' ' * (n - 2) + '*' + ' ' * (n - 2) + '*')
for i in range(1, n - 1):
    print(' ' * (n - i - 1) + '*' + ' ' * (n - 2) + '*' + ' ' * (2 * i - 1) + '*' + ' ' * (n - 2) + '*')
print('*' * n + ' ' * (2 * (n - 2) + 1) + '*' * n)
